const classrooms18block = {
         1: [
            { number: "102", name: "Учебная лабаратория", type: "other" },
            { number: "103", name: "Учебная лабаратория", type: "other" },
            { number: "104", name: "Учебная лабаратория", type: "other" },
            { number: "106", name: "Учебная лабаратория", type: "other" },
            { number: "107", name: "Учебная лабаратория", type: "other" },
            { number: "108", name: "Учебная лабаратория", type: "lab" }
        ],
        2: [
            { number: "201", name: "Учебная аудитория", type: "lab" },
            { number: "203", name: "Учебная лабаратория", type: "lab" },
            { number: "204", name: "Комендант", type: "lab" },
            { number: "205", name: "Учебная лабаратория", type: "lab" },
            { number: "206", name: "Учебная лабаратория", type: "lab" },
            { number: "207", name: "Учебная лабаратория", type: "lab" },
            { number: "208", name: "Учебная лабаратория", type: "lab" },
            { number: "209", name: "Учебная лабаратория", type: "lab" },
            { number: "210", name: "Учебная лабаратория", type: "other" },
            { number: "211", name: "Учебная лабаратория", type: "lab" },
            { number: "212", name: "Учебная лабаратория", type: "lab" },
            { number: "213", name: "Учебная лабаратория", type: "lab" },
            { number: "214", name: "Учебная лабаратория", type: "lab" },
            { number: "215", name: "Диспечер кафедры", type: "lab" },
            { number: "216", name: "Заведующий кафедрой наноинженерии", type: "lab" }
        ],
        3: [
            { number: "301", name: "Кафедра лазерных и биотехнических систем", type: "lab" },
            { number: "302", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "303", name: "Учебная аудитория", type: "lab" },
            { number: "304", name: "Учебная аудитория", type: "lab" },
            { number: "305", name: "Учебная аудитория", type: "lab" },
            { number: "306", name: "Учебная аудитория", type: "lab" },
            { number: "307", name: "Учебная аудитория", type: "lab" },
            { number: "308", name: "Учебная лабаратория", type: "lab" },
            { number: "309", name: "Учебная лабаратория", type: "lab" },
            { number: "310", name: "Учебная лабаратория", type: "lab" },
            { number: "311", name: "Учебная лабаратория", type: "lab" },
            { number: "312", name: "Учебный кабинет", type: "lab" },
            { number: "313", name: "Учебный кабинет", type: "lab" },
            { number: "314", name: "Учебный кабинет", type: "lab" },
            { number: "315", name: "Лаборатория биотехнических систем", type: "lab" }
        ],
        4: [
            { number: "401", name: "Учебный секретарь университета", type: "lab" },
            { number: "402", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "403", name: "Учебный кабинет", type: "lab" },
            { number: "404", name: "Выставочный зал научных разработок ", type: "lab" },
            { number: "405", name: "Учебный кабинет", type: "lab" },
            { number: "406", name: "Приемная ректора Самарского университета им. Королева ", type: "lab" },
            { number: "407", name: "НИЛ 101 «Физика и химия горения». Первый проректор- проректор по науке ", type: "lab" },
            { number: "408", name: "Учебный кабинет", type: "lab" },
            { number: "409", name: "НИЛ 101 «Физика и химия горения». Научный руководитель ", type: "lab" },
            { number: "410", name: "Учебный кабинет", type: "lab" }
        ],
        5: [
            { number: "501", name: "Заведующий межвузовской кафедрой космических исследований ", type: "lab" },
            { number: "502", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "503", name: "Лабаратория системного анализа космических миссий ", type: "lab" },
            { number: "504", name: "Помещение для хранения и профилактического обслуживания учебного оборудования ", type: "lab" },
            { number: "505", name: "Учебная аудитория", type: "lab" },
            { number: "506", name: "Учебный кабинет ", type: "lab" },
            { number: "507", name: "Учебный кабинет ", type: "lab" },
            { number: "508", name: "Студенческое конструкторское бюро ", type: "lab" },
            { number: "509", name: "Учебная аудитория", type: "lab" },
            { number: "510", name: "Научно-образовательный центр ", type: "lab" },
            { number: "511", name: "Научно-образовательный центр малых космических аппаратов ", type: "lab" },
            { number: "512", name: "Лаборатория обработки систем малых космический аппаратов", type: "lab" },
            { number: "513", name: "Учебный кабинет ", type: "lab" },
            { number: "514", name: "Учебный кабинет ", type: "lab" },
            { number: "515", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "516", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "517", name: "Учебный кабинет ", type: "lab" },
            { number: "518", name: "Научный руководительский зал", type: "lab" },
            { number: "519", name: "Молодежный научно-инновационный центр ", type: "lab" },
            { number: "520", name: "Помещение для самостоятельных работ ", type: "lab" }
        ],
        6: [
            { number: "601", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "602", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "603", name: "Учебный кабинет", type: "lab" },
            { number: "604", name: "Учебный кабинет", type: "lab" },
            { number: "605", name: "Учебный кабинет", type: "lab" },
            { number: "606", name: "Учебный кабинет", type: "lab" },
            { number: "607", name: "Учебный кабинет", type: "lab" },
            { number: "608", name: "Учебная аудитория специальное помещение ", type: "lab" },
            { number: "609", name: "Зал совещаний ", type: "lab" },
            { number: "610", name: "Компьютерный класс", type: "lab" },
            { number: "611", name: "Компьютерный класс", type: "lab" },
            { number: "612", name: "Кафедра геоинформатики и информационной безопасности", type: "lab" },
            { number: "613", name: "Научно-исследовательская лаборатория ", type: "lab" },
            { number: "614", name: "Северная", type: "lab" },
            { number: "615", name: "Преподавательская (кафедра геоинформатики и информационной безопасности)", type: "lab" },
            { number: "616", name: "Центр беспилотных систем учебный класс", type: "lab" },
            { number: "617", name: "Учебный коворкинг", type: "lab" }
        ],
        7: [
            { number: "701", name: "Центр приема и обработки космической информации", type: "lab" },
            { number: "702", name: "Отдел по защите государственной тайны и информации", type: "lab" },
            { number: "703", name: "Серверная ", type: "lab" },
            { number: "704", name: "Лабаратория геоинформатики и информационной безопасности", type: "lab" },
            { number: "705", name: "Поволжский центр космический геоинформатики.Лабаратория геоинформационной безопасности", type: "lab" },
            { number: "706", name: "Научно-иследовательская лабаратория геоинформатики и иновационной безопасности", type: "lab" }

        ]

        // Примечание: все номера, не подходящие под правило "трёхзначный номер" (например '59', 'ц03', '4, 21-32', '3с', '1', '6', '45', 'ц8/2' и т.д.)
        // я не включил сюда. Если хочешь — могу добавить их в отдельный список misc или вручную распределить.
    };


